Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/bsp/gd32/bsp.c
/*****************************************************************************
* BSP for PICDEM 2 PLUS with PIC18F452
* Last Updated for Version: 4.4.01
* Date of the Last Update:  Mar 23, 2012
*
*                    Q u a n t u m     L e a P s
*                    ---------------------------
*                    innovating embedded systems
*
* Copyright (C) 2002-2012 Quantum Leaps, LLC. All rights reserved.
*
* This software may be distributed and modified under the terms of the GNU
* General Public License version 2 (GPL) as published by the Free Software
* Foundation and appearing in the file GPL.TXT included in the packaging of
* this file. Please note that GPL Section 2[b] requires that all works based
* on this software must also be made publicly available under the terms of
* the GPL ("Copyleft").
*
* Alternatively, this software may be distributed and modified under the
* terms of Quantum Leaps commercial licenses, which expressly supersede
* the GPL and are specifically designed for licensees interested in
* retaining the proprietary status of their code.
*
* Contact information:
* Quantum Leaps Web sites: http://www.quantum-leaps.com
*                          http://www.state-machine.com
* e-mail:                  info@quantum-leaps.com
*****************************************************************************/
#include "stm32f0xx.h"
#include "bsp.h"
#include "projBsp.h"
#include "qp_port.h"
#include "object_ids.h"
#include "UartDrv.h"
#include "commonTypes.h"
#include "trace.h"

#if defined(TP_AUDIO_V1) 
#include "deviceTypes_v1.h" 
#else 
#include "deviceTypes_v2.h" 
#endif

#ifdef HAS_DYNAMIC_MEMORY_CONTROL
#include "Setting_id.h"
#include "SettingSrv.h"
#endif

#ifndef BSP_DEBUG_ENABLE
#undef TP_PRINTF
#define TP_PRINTF(...)
#endif


#define SYSCLK_FREQ_72MHz_HSI		72000000
#define SYSCLK_FREQ_48MHz_HSI		48000000

#define SYSCLK_FREQ SYSCLK_FREQ_48MHz_HSI


#define INTERNAL_CLOCK  0
#define EXTERNAL_CLOCK 0x04
#define PLL_CLOCK  0x08

static void SetSysClock(void);
static void SystemCoreClockUpdate (void);
//static void BSP_InitDelayTimer(void);
#ifdef ENABLE_STM_READ_PROTECTION
static void SystemEnableStmReadProtection(void);
#endif

/* clock frequency 8M (internal clock) */
uint32_t SystemCoreClock    = SYSCLK_FREQ;
__I uint8_t AHBPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

//Q_DEFINE_THIS_FILE
#define Sleep() // TODO

volatile static uint32 currTime = 0;

void SysTick_Handler(void);

static void SetSysClockTo72HSI(void); 
static void SetSysClockTo48HSI(void);


/* system_sleeping_status*/
static bool isSystemAwake = TRUE;

/******************************************************************************/
/*            Cortex-M0 Processor Exceptions Handlers                         */
/******************************************************************************/

/**
  * @brief  This function handles NMI exception.
  * @param  None
  * @retval None
  */
void NMI_Handler(void)
{
    while (1);
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
void HardFault_Handler(void)
{
  /* Execute assert handler and print error message
   */
  Q_onAssert("HardFault_Handler", 0);
  
  /* Go to infinite loop when Hard Fault exception occurs */
  /* when hardFault happen, MCU will stop here, trace the call stack for debug info*/
  while (1);
}

/**
  * @brief  This function handles SVCall exception.
  * @param  None
  * @retval None
  */
void SVC_Handler(void)
{
    while (1);
}

/**
  * @brief  This function handles PendSVC exception.
  * @param  None
  * @retval None
  */
void PendSV_Handler(void)
{
    while (1);
}


/**
* Public function to check if the system is in deep sleep status
* @return[in]   TRUE/FALSE      Sleep or wakedup
*/
bool BSP_IsSystemAwake()
{
    return (isSystemAwake ? TRUE : FALSE);
}

void BSP_SetSystemAwake(bool awake)
{
    isSystemAwake = awake;
}
/* End of system_sleeping_status */

/*..........................................................................*/
void SysTick_Handler(void) {                       /* system clock tick ISR */
    QF_TICK_X(0U, (void *)0);              /* process all armed time events */
    ++currTime;
}
/*..........................................................................*/
void BSP_init_clock(void)
{
    /* update the clock value "SystemCoreClock" */
   //SystemCoreClockUpdate();
#if (SYSCLK_FREQ == SYSCLK_FREQ_72MHz_HSI)
    SetSysClockTo72HSI();
#elif (SYSCLK_FREQ == SYSCLK_FREQ_48MHz_HSI)
   SetSysClockTo48HSI();
#endif
   if (SysTick_Config(SystemCoreClock / 1000))
   { 
      /* Capture error */ 
      while (1);
   }
}
/*..........................................................................*/
void BSP_init(void)
{
   BSP_init_clock();
   //BSP_InitDelayTimer();

#ifdef ENABLE_STM_READ_PROTECTION
    SystemEnableStmReadProtection();
#endif

}
/*..........................................................................*/
void QF_onStartup(void)
{
   
}
/*..........................................................................*/
void QF_onCleanup(void) {
}
/*..........................................................................*/
void QF_onIdle(void) {      /* entered with interrupts disabled, see NOTE01 */
#ifdef Q_SPY
    if (PIR1bits.TXIF != 0U) {                              /* TXREG empty? */
        uint16_t b = QS_getByte();
        if (b != QS_EOD) {                 /* next QS trace byte available? */
            TXREG = (uint8_t)b; /* stick the byte to TXREG for transmission */
        }
    }
#elif defined NDEBUG
    Sleep();                        /* transition to SLEEP mode, see NOTE02 */
#endif
    QF_INT_ENABLE();                                   /* enable interrupts */
}
/*..........................................................................*/
/* in_exp can not be bool type, becuase bool type will assign to either 1 or 0
 * when stack overflow occurs, it will always treated as TRUE.
 */
static uint32 in_exp= FALSE;

