Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/bsp/gd32/bsp.c
bool BSP_InExp()
{
    /* Avoid enter nested exception 
     * When stack overflow, in_exp may be overwrote to large value (not 1 or 0), thus we should not decide
     *   if( !in-exp )
     * the better decision is 
     *   if(in_exp!=TRUE)
     */
    if(in_exp==TRUE)
    {
        return TRUE;
    }
    else
    {
        return FALSE;
    }    
}


void Q_onAssert(char const Q_ROM * const Q_ROM_VAR file, int line) {
    #define SNPRINTF_BUFFER_MAX_SIZE                (200)
    (void)file;                                   /* avoid compiler warning */
    (void)line;                                   /* avoid compiler warning */ 
    static char buffer[SNPRINTF_BUFFER_MAX_SIZE];

    /* Avoid enter nested exception 
     * When stack overflow, in_exp may be overwrote to large value (not 1 or 0), thus we should not decide
     *   if( !in-exp )
     * the better decision is 
     *   if(in_exp!=TRUE)
     */
    if( !BSP_InExp() )
    {
        in_exp= TRUE;
        __disable_interrupt();

#ifdef PROJECT_SPEC_ASSERT_HANDLER
        ProjBsp_AssertHandler(file, line);
#endif

#ifdef NDEBUG
        //TODO: print error one time
        BSP_SoftReboot();
#else
        tUARTDevice *pConfig = (tUARTDevice *)getDevicebyId(DEBUG_DEV_ID, NULL); /*get the uart ID */
        if(NULL != pConfig)
        {
            snprintf(buffer,SNPRINTF_BUFFER_MAX_SIZE,"\r\nASSERT: %s,\r\nline: %d\r\n", file, line);
            while(1)
            {      
                /* Avoid watchdog timeout on debug build, to keep print error message */
#ifdef HAS_IWDG              
                IWDG_ReloadCounter();
#endif
                UartDrv_Write_Blocking(pConfig->uartId,(uint8 *)buffer,strlen(buffer));//print debug message in blocking mode

                BSP_ExpBlockingDelayMs(1000);
            }
        }
#endif
    }
    for (;;) 
    {
#ifdef HAS_IWDG
        IWDG_ReloadCounter();
#endif
    }
}

/*..........................................................................*/
/* assert function for stm library,          */
/* add Macro "USE_FULL_ASSERT" to turn it on */
/*..........................................................................*/
void assert_failed(uint8_t* file, uint32_t line)
{    
    Q_onAssert((char*)file,(int)line);
}

/**
* @brief Get the tick elapsed
* @return   uint32  the tick elapsed
*/
uint32 getSysTime()
{
    return currTime;
}

#define MILLISECONDS_IN_DAY (24*60*60*1000)
#define MILLISECONDS_IN_HOUR   (60*60*1000)
#define MILLISECONDS_IN_MINUTE    (60*1000)
#define MILLISECONDS_IN_SECOND       (1000)

void getSysTimePretty(uint8* day, uint8* hour, uint8* minute, uint8* second, uint16* millisecond)
{
    *day = currTime / MILLISECONDS_IN_DAY;
    *hour = (currTime - (*day * MILLISECONDS_IN_DAY)) / MILLISECONDS_IN_HOUR;
    *minute = (currTime - (*day * MILLISECONDS_IN_DAY) - (*hour * MILLISECONDS_IN_HOUR)) / MILLISECONDS_IN_MINUTE;
    *second = (currTime - (*day * MILLISECONDS_IN_DAY) - (*hour * MILLISECONDS_IN_HOUR) - (*minute * MILLISECONDS_IN_MINUTE)) / MILLISECONDS_IN_SECOND;
    *millisecond = (currTime - (*day * MILLISECONDS_IN_DAY) - (*hour * MILLISECONDS_IN_HOUR) - (*minute * MILLISECONDS_IN_MINUTE) - (*second * MILLISECONDS_IN_SECOND));
}

void BSP_SoftReboot(void)
{
    //Disable all interrupt, to avoid interrupt occurs before reset
    __disable_irq();

    //Reset system
    NVIC_SystemReset();
}


void BSP_BlockingDelayMs(uint32 ms)
{
    uint32_t tickstart = getSysTime();
    while(getSysTime() - tickstart < ms)
    {
#ifdef HAS_IWDG
        // feed the dog when blocking delay
        IWDG_ReloadCounter();
#endif
    }
}


/* -----------------------------------------------------------------------
    TIM3 Configuration: Output Compare Timing Mode:
    
    In this example TIM3 input clock (TIM3CLK) is set to APB1 clock (PCLK1),  
      => TIM3CLK = PCLK1 = SystemCoreClock = 1 MHz
          
    To get TIM3 counter clock at 1 MHz, the prescaler is computed as follows:
       Prescaler = (TIM3CLK / TIM3 counter clock) - 1
       Prescaler = (PCLK1 /1 MHz) - 1
                                              
    CC1 update rate = TIM3 counter clock / CCR1_Val = 1000  Hz
    
    Note: 
     SystemCoreClock variable holds HCLK frequency and is defined in system_stm32f0xx.c file.
     Each time the core clock (HCLK) changes, user had to call SystemCoreClockUpdate()
     function to update SystemCoreClock variable value. Otherwise, any configuration
     based on this variable will be incorrect.    
  ----------------------------------------------------------------------- */  
/* no need to change these Macro */
//#define TIM3_CLK  1000000  //use 1M, 1us each count
//#define CCR1_VAL  1000     
//
//static void BSP_InitDelayTimer()
//{
//    /* TIM3 clock enable */
//    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
//    
//    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
//    TIM_OCInitTypeDef  TIM_OCInitStructure;
//    
//    /* Compute the prescaler value */
//    uint16 PrescalerValue = (uint16) (SystemCoreClock  / TIM3_CLK) - 1;
//
//    /* Time base configuration */
//    TIM_TimeBaseStructure.TIM_Period = 65535;
//    TIM_TimeBaseStructure.TIM_Prescaler = 0;
//    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
//    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
//
//    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
//
//    /* Prescaler configuration */
//    TIM_PrescalerConfig(TIM3, PrescalerValue, TIM_PSCReloadMode_Immediate);
//
//    /* Output Compare Timing Mode configuration: Channel1 */
//    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Timing;
//    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
//    TIM_OCInitStructure.TIM_Pulse = CCR1_VAL;
//    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
//
//    TIM_OC1Init(TIM3, &TIM_OCInitStructure);
//
//    TIM_OC1PreloadConfig(TIM3, TIM_OCPreload_Disable);
//
//    /* TIM Interrupts enable */
//    TIM_ITConfig(TIM3, TIM_IT_CC1, ENABLE);
//
//    /* TIM3 enable counter */
//    TIM_Cmd(TIM3, ENABLE);
//}

/***************************************************************************
*
* watchdog place holder
*
****************************************************************************/

/* Watchdog */
void BSP_EnableWatchdog(void)
{   
}

void BSP_DisableWatchdog(void)
{
}

void BSP_FeedWatchdog(void)
{
}


/***************************************************************************
*
* Clock setting for STM32, move here from STM library.
*
****************************************************************************/
/**
  * @brief  Setup the microcontroller system.
  *         Initialize the Embedded Flash Interface, the PLL and update the 
  *         SystemCoreClock variable.
  * @param  None
  * @retval None
  */
void SystemInit (void)
{
  /* Set HSION bit */
  RCC->CR |= (uint32_t)0x00000001;

  /* Reset SW[1:0], HPRE[3:0], PPRE[2:0], ADCPRE and MCOSEL[2:0] bits */
  RCC->CFGR &= (uint32_t)0xF8FFB80C;
  
  /* Reset HSEON, CSSON and PLLON bits */
  RCC->CR &= (uint32_t)0xFEF6FFFF;

