Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/bsp/gd32/bsp.c
  /* Reset HSEBYP bit */
  RCC->CR &= (uint32_t)0xFFFBFFFF;

  /* Reset PLLSRC, PLLXTPRE and PLLMUL[3:0] bits */
  RCC->CFGR &= (uint32_t)0xFFC0FFFF;

  /* Reset PREDIV1[3:0] bits */
  RCC->CFGR2 &= (uint32_t)0xFFFFFFF0;

  /* Reset USARTSW[1:0], I2CSW, CECSW and ADCSW bits */
  RCC->CFGR3 &= (uint32_t)0xFFFFFEAC;

  /* Reset HSI14 bit */
  RCC->CR2 &= (uint32_t)0xFFFFFFFE;

  /* Disable all interrupts */
  RCC->CIR = 0x00000000;

  /* Configure the System clock frequency, AHB/APBx prescalers and Flash settings */
  SetSysClock();
}

/**
  * @brief  Update SystemCoreClock according to Clock Register Values
  *         The SystemCoreClock variable contains the core clock (HCLK), it can
  *         be used by the user application to setup the SysTick timer or configure
  *         other parameters.
  *
  * @note   Each time the core clock (HCLK) changes, this function must be called
  *         to update SystemCoreClock variable value. Otherwise, any configuration
  *         based on this variable will be incorrect.         
  *
  * @note   - The system frequency computed by this function is not the real 
  *           frequency in the chip. It is calculated based on the predefined 
  *           constant and the selected clock source:
  *
  *           - If SYSCLK source is HSI, SystemCoreClock will contain the HSI_VALUE(*)
  *                                              
  *           - If SYSCLK source is HSE, SystemCoreClock will contain the HSE_VALUE(**)
  *                          
  *           - If SYSCLK source is PLL, SystemCoreClock will contain the HSE_VALUE(**)
  *             or HSI_VALUE(*) multiplied/divided by the PLL factors.
  *
  *         (*) HSI_VALUE is a constant defined in stm32f0xx.h file (default value
  *             8 MHz) but the real value may vary depending on the variations
  *             in voltage and temperature.
  *
  *         (**) HSE_VALUE is a constant defined in stm32f0xx.h file (default value
  *              8 MHz), user has to ensure that HSE_VALUE is same as the real
  *              frequency of the crystal used. Otherwise, this function may
  *              have wrong result.
  *
  *         - The result of this function could be not correct when using fractional
  *           value for HSE crystal.
  * @param  None
  * @retval None
  */

static void SystemCoreClockUpdate (void)
{
  uint32_t tmp = 0, pllmull = 0, pllsource = 0, prediv1factor = 0;
  /* if you are using default HSI, you can define an empty function in your projBsp.c*/
  ProjBsp_SysClkUpdate();
  /* Get SYSCLK source -------------------------------------------------------*/
  tmp = RCC->CFGR & RCC_CFGR_SWS;
  
  switch (tmp)
  {
    case INTERNAL_CLOCK:  /* HSI used as system clock */
      SystemCoreClock = HSI_VALUE;
      break;
    case EXTERNAL_CLOCK:  /* HSE used as system clock */
      SystemCoreClock = HSE_VALUE;
      break;
    case PLL_CLOCK:  /* PLL used as system clock */
      /* Get PLL clock source and multiplication factor ----------------------*/
      pllmull = RCC->CFGR & RCC_CFGR_PLLMULL;
      pllsource = RCC->CFGR & RCC_CFGR_PLLSRC;
      pllmull = ( pllmull >> 18) + 2;
      
      if (pllsource == 0x00)
      {
        /* HSI oscillator clock divided by 2 selected as PLL clock entry */
        SystemCoreClock = (HSI_VALUE >> 1) * pllmull;
      }
      else
      {
        prediv1factor = (RCC->CFGR2 & RCC_CFGR2_PREDIV1) + 1;
        /* HSE oscillator clock selected as PREDIV1 clock entry */
        SystemCoreClock = (HSE_VALUE / prediv1factor) * pllmull; 
      }      
      break;
    default: /* HSI used as system clock */
      SystemCoreClock = HSI_VALUE;
      break;
  }
  /* Compute HCLK clock frequency ----------------*/
  /* Get HCLK prescaler */
  tmp = AHBPrescTable[((RCC->CFGR & RCC_CFGR_HPRE) >> 4)];
  /* HCLK clock frequency */
  SystemCoreClock >>= tmp;  
}

extern int CSTACK$$Base;            /* symbol created by the IAR linker */
extern int CSTACK$$Limit;
#define STACK_MAGIC_NUM  0x1234ABCD
int stackMagicNumberFill(void)
{
  const char *pStackBase  = (char *)&CSTACK$$Base;
  const char *pStackLimit = (char *)&CSTACK$$Limit;
  const uint32 stackSize  = pStackLimit - pStackBase;
  const int32 sp= __get_MSP();
  const char *pWriteEnd= (char*)( (sp-128)/16*16 ); //we can not fill with sp directly, becuase sp may used by current function
  
  //Assert Check
  ASSERT( pWriteEnd > pStackBase );
  ASSERT( stackSize > 16 ); //Ensure stack have enough size to fill magic number
  ASSERT( stackSize % 16 == 0); //We treat 16bytes as a section to check magic number, thus stack size must be multiple by 16
  
  //Write magic number
  char *p;
  for(p=(char*)pStackBase ; p<=(char*)pWriteEnd ; p+=4)
  {
      *(uint32*)p= STACK_MAGIC_NUM;
  }
  
  //uint32 stack_usage= stackMaxUsage();
  
  return 0;
}


/* return TRUE if stack overflow
 */
bool stackOverflowCheck(void)
{
    char *pStackBase= (char *)&CSTACK$$Base;
    static uint32 buf[4]={STACK_MAGIC_NUM, STACK_MAGIC_NUM, STACK_MAGIC_NUM, STACK_MAGIC_NUM};
    bool rtn= memcmp(buf, pStackBase, 4); //compare 16 bytes on top of stack
    
    /* memcmp() return 0 => compare the same => not overflow
     * memcmp() return non-0 => compare different => overflow
     */
    return rtn;
}


/* return stack size (byte)
 */
uint32 stackSize(void)
{
    const char *pStackBase  = (char *)&CSTACK$$Base;
    const char *pStackLimit = (char *)&CSTACK$$Limit;
    const uint32 stackSize  = pStackLimit - pStackBase;
    return stackSize;
}


/* return stack usage (byte)
 */
uint32 stackMaxUsage(void)
{
  const char *pStackBase  = (char *)&CSTACK$$Base;
  const char *pStackLimit = (char *)&CSTACK$$Limit;
  const char* sp          = (char*)__get_MSP();
  const uint32 stackSize  = (char*)pStackLimit - (char*)pStackBase;
  
  uint32 stack_usage = pStackLimit - sp;
  char *p;
  for(p=(char*)pStackBase ; p<sp ; p+=4)
  {
      if( (*(uint32*)p) != STACK_MAGIC_NUM )
      {
          stack_usage= pStackLimit - p;
          break;
      }
  }
  
  ASSERT(stack_usage <= stackSize);
  return stack_usage;
}

/**
  * @brief  Configures the System clock frequency, AHB/APBx prescalers and Flash
  *         settings.
  * @note   This function should be called only once the RCC clock configuration
  *         is reset to the default reset state (done in SystemInit() function).
  * @param  None
  * @retval None
  */
static void SetSysClock(void)
{
#ifdef SYSCLK_FREQ_HSE
  SetSysClockToHSE(); 
#elif (SYSCLK_FREQ == SYSCLK_FREQ_72MHz_HSI)
  SetSysClockTo72HSI();
#elif (SYSCLK_FREQ == SYSCLK_FREQ_48MHz_HSI)
  SetSysClockTo48HSI();
#endif 
 /* If none of the define above is enabled, the HSI is used as System clock
    source (default after reset) */ 
}



/**
  * @brief  Configures the System clock frequency, AHB/APBx prescalers and Flash
  *         settings.
  * @note   This function should be called only once the RCC clock configuration
  *         is reset to the default reset state (done in SystemInit() function).
  * @param  None
  * @retval None
  */
static void SetSysClockTo72HSI(void)
{
  __IO uint32_t StartUpCounter = 0, HSIStatus = 0;
  
