Edmond-Sung-Tymphany/Hendrix_M_Lite_GD/sw/bsp/gd32/bsp.c
void DynamicAnalysis()
{
#ifdef HAS_DYNAMIC_MEMORY_CONTROL
    const uint32 margin_percent_warning= HAS_DYNAMIC_MEMORY_CONTROL_WARNING_PERCENTAGE;
    uint16 margin;
    uint32 margin_percent;
    //uint8  day;
    //uint8  hour;
    //uint8  minute;
    //uint8  second;
    //uint16 millisecond;
    TP_PRINTF("\r\n\r\n");
    TP_PRINTF("===DynamicAnalysis===Queues=======Remain======\r\n");
#ifdef HAS_DEBUG
    margin = QF_getQueueMin(DEBUG_SRV_ID);
    margin_percent= margin*100/DBG_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_DEBUG_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_DEBUG_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| DEBUG_SRV_ID      [%3d][%3d]   %3d%%  %s\r\n", margin,  DBG_SRV_EVENT_Q_SIZE,  margin*100/DBG_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#if defined(HAS_SETTING) && defined(SETTING_HAS_ROM_DATA)
    margin = QF_getQueueMin(SETTING_SRV_ID);
    margin_percent= margin*100/SETT_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_SETTING_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_SETTING_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| SETTING_SRV_ID    [%3d][%3d]   %3d%%  %s\r\n", margin, SETT_SRV_EVENT_Q_SIZE,  margin*100/SETT_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#ifdef HAS_AUDIO_CONTROL
    margin = QF_getQueueMin(AUDIO_SRV_ID);
    margin_percent= margin*100/AUDIO_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_AUDIO_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_AUDIO_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| AUDIO_SRV_ID      [%3d][%3d]   %3d%%  %s\r\n", margin, AUDIO_SRV_EVENT_Q_SIZE,  margin*100/AUDIO_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#ifdef HAS_LEDS
    margin = QF_getQueueMin(LED_SRV_ID);
    margin_percent= margin*100/LED_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_LEDS_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_LEDS_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| LED_SRV_ID        [%3d][%3d]   %3d%%  %s\r\n", margin, LED_SRV_EVENT_Q_SIZE,  margin*100/LED_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#ifdef HAS_BLUETOOTH
    margin = QF_getQueueMin(BT_SRV_ID);
    margin_percent= margin*100/KEY_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_BLUETOOTH_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_BLUETOOTH_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| BT_SRV_ID         [%3d][%3d]   %3d%%  %s\r\n", margin, BT_SRV_EVENT_Q_SIZE);
#endif
#ifdef HAS_KEYS
    margin = QF_getQueueMin(KEY_SRV_ID);
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_KEYS_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_KEYS_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| KEY_SRV_ID        [%3d][%3d]   %3d%%  %s\r\n", margin, KEY_SRV_EVENT_Q_SIZE,  margin*100/KEY_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#ifdef HAS_POWER_CONTROL
    margin = QF_getQueueMin(POWER_SRV_ID);
    margin_percent= margin*100/POWER_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_POWER_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_POWER_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| POWER_SRV_ID      [%3d][%3d]   %3d%%  %s\r\n", margin, POWER_SRV_EVENT_Q_SIZE,  margin*100/POWER_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
#if defined(HAS_ASE_TK) || defined(HAS_ASE_NG)
    margin = QF_getQueueMin(ASETK_SRV_ID);
    margin_percent= margin*100/ASETK_SRV_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_ASE_TK_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_ASE_TK_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| ASETK_SRV_ID      [%3d][%3d]   %3d%%  %s\r\n", margin, ASETK_SRV_EVENT_Q_SIZE,  margin*100/ASETK_SRV_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
#endif
    margin = QF_getQueueMin(MAIN_APP_ID);
    margin_percent= margin*100/MAINAPP_EVENT_Q_SIZE;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_QUEUE_MIN_DEBUG_SRV) > (uint32)margin)
    {
        Setting_Set(SETID_QUEUE_MIN_DEBUG_SRV, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| MAIN_APP_ID       [%3d][%3d]   %3d%%  %s\r\n", margin, MAINAPP_EVENT_Q_SIZE,  margin*100/MAINAPP_EVENT_Q_SIZE, (margin_percent<=margin_percent_warning)?"==>WARNING":"");

    TP_PRINTF("===DynamicAnalysis===Pools========Remain======\r\n");
    margin = QF_getPoolMin(1);
    margin_percent= margin*100/NUM_OF_SMALL_EVENTS;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_POOL_MIN_SMALL) > (uint32)margin)
    {
        Setting_Set(SETID_POOL_MIN_SMALL, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| PollSmall         [%3d][%3d]   %3d%%  %s\r\n", margin, NUM_OF_SMALL_EVENTS,  margin*100/NUM_OF_SMALL_EVENTS, (margin_percent<=margin_percent_warning)?"==>WARNING":"");

    margin = QF_getPoolMin(2);
    margin_percent= margin*100/NUM_OF_MEDIUM_EVENTS;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_POOL_MIN_MEDIUM) > (uint32)margin)
    {
        Setting_Set(SETID_POOL_MIN_MEDIUM, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| PollMedium        [%3d][%3d]   %3d%%  %s\r\n", margin, NUM_OF_MEDIUM_EVENTS,  margin*100/NUM_OF_MEDIUM_EVENTS, (margin_percent<=margin_percent_warning)?"==>WARNING":"");

    margin = QF_getPoolMin(3);
    margin_percent= margin*100/NUM_OF_LARGE_EVENTS;
    ASSERT(margin_percent>margin_percent_warning); //early assert on debug build, the remind size is near empty
    if (*(uint32*)Setting_Get(SETID_POOL_MIN_LARGE) > (uint32)margin)
    {
        Setting_Set(SETID_POOL_MIN_LARGE, &margin);
    }
    ASSERT(margin > 0);
    TP_PRINTF("|| PollLarge         [%3d][%3d]   %3d%%  %s\r\n", margin, NUM_OF_LARGE_EVENTS,  margin*100/NUM_OF_LARGE_EVENTS, (margin_percent<=margin_percent_warning)?"==>WARNING":"");
    TP_PRINTF("==============================================\r\n\r\n");
    //getSysTimePretty(&day,&hour,&minute,&second,&millisecond);
    //TP_PRINTF("Time [%d:%02d:%02d:%02d.%03d]\r\n", day, hour, minute, second, millisecond);
#endif
}

/*
    t_IWDG = t_LSI(ms) * 4 * (IWDG_RLR[11:0]+1) * 2 ^ (IWDG_PR[2:0]) = [125 us..32.8s]

    Example:

    LSI clock 40kHz => t_LSI(ms) = 1/40000 = 0.025
    reload = 0x0FFF => (IWDG_RLR[11:0]+1)  = 4096
    prescale = 6    => 2 ^ (IWDG_PR[2:0])  = 64

    t_IWDG = 26.2s
*/
void IwdgInit(uint8_t prescaler, uint16_t reload)
{
#if 1//def HAS_IWDG
    IWDG_Enable();
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(prescaler);
    IWDG_SetReload(reload);
    while (SET == IWDG_GetFlagStatus(IWDG_FLAG_PVU));
    while (SET == IWDG_GetFlagStatus(IWDG_FLAG_RVU));
    IWDG_ReloadCounter();

    /* Pause WDOG when use IAR to online debug */
    DBGMCU_Config(DBGMCU_IWDG_STOP, ENABLE);
#endif
}
void IwdgReloadActiveMode()
{
#ifdef HAS_IWDG
    IWDG_ReloadCounter();
#endif
}
void IwdgReloadOffMode()
{
#ifdef HAS_IWDG
    IWDG_ReloadCounter();
#endif
}

